{
  "metadata": {
    "title": "Danilo Lopes | Junior Front-end Developer",
    "description": "Junior Front-end Developer with experience in React, Next.js, and TypeScript. Here is my portfolio with projects I have developed over the years.",
    "keywords": "Danilo Lopes, Front-end Developer, Junior Developer, React, JavaScript, Next.js, TypeScript, Front-End Portfolio, Web Developer, UX Design"
  },
  "Navbar": {
    "home": "Home",
    "about": "About",
    "portfolio": "Portfolio",
    "contact": "Contact"
  },
  "herosection": {
    "mini": "Front-end Developer",
    "title": {
      "part1": "Danilo Lopes",
      "part2": "Development"
    },
    "paragraph": "I create functional, accessible and visually striking digital solutions. From prototyping to coding, my goal is to deliver seamless and user-focused experiences.",
    "btn": {
      "textOne": "View Portfolio",
      "textTwo": "Contact Me"
    },
    "scroll": "Scroll down"
  },
  "about": {
    "title": {
      "textOne": "About",
      "textTwo": "Skills"
    },
    "paragraph": "I am a Front-end Developer and I create modern, responsive and user-centered interfaces. I work with React, Next.js, TypeScript and Tailwind, always focusing on performance and accessibility. I bring a multicultural perspective after 12 months in Europe, combining design and technology to deliver impactful digital solutions.",
    "card": {
      "textOne": "Developing for the Web",
      "textTwo": "Projects Completed"
    },
    "skills": [
      "Responsive interfaces",
      "HTML, CSS and JavaScript",
      "React and Next.js",
      "Node.js",
      "Tailwind CSS",
      "Figma prototyping",
      "Performance and Best Practices",
      "Teamwork"
    ]
  },
  "portfolio": {
    "subtitle": "Portfolio",
    "title": "Selected Projects",
    "paragraph": "Projects that transform ideas into reality",
    "button": "View",
    "card": [
      {
        "id": 1,
        "subtitle": "Front-end Developer",
        "title": "CalisthenyX",
        "description": "Modern landing page for a calisthenics training platform, focused on performance and accessibility.",
        "tech": {
          "one": "TypeScript",
          "two": "JavaScript",
          "three": "Tailwind CSS"
        }
      },
      {
        "id": 2,
        "subtitle": "Front-end Developer",
        "title": "NyxLobby",
        "description": "Lobby and authentication interface.",
        "tech": {
          "one": "TypeScript",
          "two": "JavaScript",
          "three": "Tailwind CSS"
        }
      },
      {
        "id": 3,
        "subtitle": "Front-end Developer",
        "title": "NyxTech",
        "description": "Institutional technology website.",
        "tech": {
          "one": "TypeScript",
          "two": "JavaScript",
          "three": "Tailwind CSS"
        }
      },
      {
        "id": 4,
        "subtitle": "Front-end Developer",
        "title": "Boreal Forest",
        "description": "Nature-inspired landing page with immersive visual aesthetics.",
        "tech": {
          "one": "TypeScript",
          "two": "JavaScript",
          "three": "Tailwind CSS"
        }
      },
      {
        "id": 5,
        "subtitle": "Front-end Developer",
        "title": "TendShop",
        "description": "Landing page for an e-commerce platform.",
        "tech": {
          "one": "TypeScript",
          "two": "JavaScript",
          "three": "Tailwind CSS"
        }
      },
      {
        "id": 6,
        "subtitle": "Front-end Developer",
        "title": "Animais Fantásticos",
        "description": "Interactive website developed to practice JavaScript and DOM manipulation.",
        "tech": {
          "one": "TypeScript",
          "two": "JavaScript",
          "three": "Tailwind CSS"
        }
      },
      {
        "id": 7,
        "subtitle": "Front-end Developer",
        "title": "Tavares & Saraiva Advogados",
        "description": "Legal institutional website focused on credibility, clarity, and strategic lead generation.",
        "tech": {
          "one": "TypeScript",
          "two": "JavaScript",
          "three": "Tailwind CSS"
        }
      },
      {
        "id": 8,
        "subtitle": "Front-end Developer",
        "title": "NyxStellar",
        "description": "Landing page with a futuristic aesthetic focused on visual impact and usability.",
        "tech": {
          "one": "TypeScript",
          "two": "JavaScript",
          "three": "Tailwind CSS"
        }
      }
    ]
  },
  "form": {
    "title": "Interested in working together?",
    "description": "Get in touch",
    "cardTitle": "Send an email",
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "button": "Send",
    "success": "✓ Message sent successfully!",
    "error": "✗ Error sending. Please try again.",
    "sending": "Sending..."
  },
  "footer": {
    "description": "All rights reserved."
  },
  "projects": {
    "back": "Back",
    "client": "Client",
    "duration": "Duration",
    "role": "Role",
    "challenge": "Challenge",
    "solution": "Solution",
    "results": "Results",
    "technologies": "Technologies",
    "viewSite": "View Site",
    "viewCode": "View Code",
    "items": {
      "calisthenyx": {
        "year": "2026",
        "subtitle": "Front-End Developer",
        "title": "Calisthenyx",
        "description": "CalisthenyX is a demonstrative landing page designed to present a modern calisthenics training platform, focused on user experience, performance and accessibility. Through a visually appealing interface, the project showcases training plans, calisthenics benefits and illustrative sections that convey the value of the application in a clear and intuitive way.",
        "client": "Personal Project",
        "duration": "1 month",
        "role": "Front-End Developer",
        "challenge": "The main challenge was to create a responsive, accessible and SEO-optimized interface capable of conveying professionalism and clarity without relying on a complex backend. The idea was to build a digital showcase that could become the foundation for a future complete training platform, serving both beginners and enthusiasts in calisthenics.",
        "solution": "The solution was built with a modern framework (Next.js) and a set of technologies that favor development speed and user experience.",
        "results": [
          "Responsive and modern landing page;",
          "Performance and SEO optimized;",
          "Good usability and accessibility;",
          "Structure ready to scale."
        ],
        "technologies": [
          "Next.js",
          "Tailwind CSS",
          "Typescript",
          "React Icons",
          "clsx"
        ]
      },
      "nyxlobby": {
        "year": "2026",
        "subtitle": "Front-End Developer",
        "title": "NyxLobby",
        "description": "NyxLobby is a project focused on creating a modern lobby/authentication interface, designed to be the starting point of access to web applications. The project explores UI best practices, component organization and user experience, serving as a reusable foundation for larger systems.",
        "client": "Personal Project",
        "duration": "2 months",
        "role": "Full-Stack Development",
        "challenge": "The main challenge was to create a clear, elegant and functional entry interface that conveyed security and professionalism at first contact with the user. It was also essential to keep the code scalable, organized and easy to integrate with authentication and backend systems in the future.",
        "solution": "The solution was to develop a visually consistent lobby with responsive layout and reusable components, prioritizing simplicity and usability. The project was structured with a focus on: clear component separation, clean and intuitive layout, modern and consistent styling, and code ready for evolution (login, registration, permissions, etc.).",
        "results": [
          "Clear and modern lobby interface;",
          "Simple and intuitive user experience;",
          "Responsive layout for different screens;",
          "Reusable base for new projects."
        ],
        "technologies": [
          "Next.js",
          "TypeScript",
          "Tailwind CSS",
          "Node.js",
          "Express",
          "MongoDB",
          "JWT",
          "Multer"
        ]
      },
      "nyxtech": {
        "year": "2026",
        "subtitle": "Front-End Developer",
        "title": "NyxTech",
        "description": "NyxTech is an institutional project focused on presenting a technology brand with a modern, clear and professional interface. The goal is to communicate services, vision and tech solutions objectively, reinforcing credibility and visual identity.",
        "client": "Personal Project",
        "duration": "1 month",
        "role": "Front-End Development",
        "challenge": "The main challenge was to translate the concept of technology and innovation into a clean and trustworthy interface, avoiding information overload. The layout needed to be impactful, responsive and easy to navigate, serving as a foundation for future institutional or commercial expansions.",
        "solution": "The solution was to develop a well-structured technology landing page with clear visual hierarchy and reusable components. The project prioritizes: clarity in service communication, modern visual aligned with the tech universe, responsiveness and good experience across different devices, and a scalable structure for new sections and features.",
        "results": [
          "Modern and professional institutional interface;",
          "Responsive and consistent layout;",
          "Clear and objective communication;",
          "Foundation ready for product evolution."
        ],
        "technologies": [
          "React",
          "TypeScript",
          "Router DOM",
          "Recharts",
          "CSS Custom Properties"
        ]
      },
      "forest": {
        "year": "2026",
        "subtitle": "Front-End Developer",
        "title": "Boreal Forest",
        "description": "Forest is a landing page project that explores a natural and minimalist aesthetic, inspired by sustainability, well-being and connection with nature. The goal is to communicate environmental values in a clear, light and visually pleasant way.",
        "client": "Personal Project",
        "duration": "3 weeks",
        "role": "Front-End Development",
        "challenge": "The main challenge was to translate the concept of nature and tranquility into a digital interface, maintaining balance between aesthetics, readability and usability. The layout needed to be simple, responsive and functional without visual excesses.",
        "solution": "The solution was to create a clean and harmonious interface with strategic use of natural colors, generous spacing and clear content hierarchy. The project prioritizes: light and pleasant visuals, intuitive navigation, responsiveness across different devices, and a reusable structure for sustainable brands and projects.",
        "results": [
          "Light and visually pleasant interface;",
          "Responsive layout;",
          "Good hierarchy and readability;",
          "Foundation ready for evolution."
        ],
        "technologies": ["HTML5", "Tailwind CSS", "Javascript"]
      },
      "tendshop": {
        "year": "2026",
        "subtitle": "Front-End Developer",
        "title": "TendShop",
        "description": "TendShop is an e-commerce landing page project created to present products in an attractive, clear and conversion-focused way. The interface explores visual trends in digital retail, prioritizing product highlighting and an intuitive shopping experience.",
        "client": "Personal Project",
        "duration": "2 months",
        "role": "Front-End Development",
        "challenge": "The main challenge was to create a commercially efficient interface, balancing modern aesthetics with information clarity. The layout needed to naturally guide the user toward action while maintaining good readability and responsiveness across all devices.",
        "solution": "The solution was to develop a clean, conversion-oriented landing page with good visual hierarchy, reusable components and strategic highlighting of products and calls to action.",
        "results": [
          "Modern layout focused on conversion;",
          "Fluid and responsive experience;",
          "Good visual hierarchy of products;",
          "Foundation ready to scale."
        ],
        "technologies": [
          "React",
          "Next.js",
          "TypeScript",
          "Tailwind CSS",
          "react-i18next"
        ]
      },
      "animais": {
        "year": "2026",
        "subtitle": "Front-End Developer",
        "title": "Animais",
        "description": "Animais Fantásticos is a project focused on building an interactive informational website, developed to practice core JavaScript concepts, DOM manipulation and front-end best practices. The project combines educational content with animations and interactions that enrich the user experience.",
        "client": "Educational Project",
        "duration": "1 month",
        "role": "Front-End Development",
        "challenge": "The main challenge was to implement dynamic interactions in an organized and performant way, ensuring the code was readable, reusable and easy to maintain, even with multiple interface behaviors.",
        "solution": "The solution was to create a modular JavaScript structure, separating responsibilities and applying code organization best practices.",
        "results": [
          "Interactive and dynamic interface;",
          "Fluid user experience;",
          "Good code organization;",
          "Smooth and engaging navigation."
        ],
        "technologies": ["Figma", "React", "TypeScript", "Vite", "Tailwind CSS"]
      },
      "nyxstellar": {
        "year": "2026",
        "subtitle": "Front-End Developer",
        "title": "NyxStellar",
        "description": "NyxStellar is a project focused on creating a landing page with a futuristic and spatial aesthetic, exploring modern visual concepts for brands and digital products. The goal is to combine visual impact, information clarity and a good browsing experience.",
        "client": "Personal Project",
        "duration": "2 months",
        "role": "Front-End Development",
        "challenge": "The challenge was to balance a strong and conceptual visual with usability, ensuring that the futuristic aesthetic did not compromise readability, information hierarchy or the user experience across different devices.",
        "solution": "The solution was to develop a visually striking interface with a well-structured layout, readable typography and reusable components. The project prioritizes: consistent and modern visual identity, clear content hierarchy, responsive and fluid navigation, and a scalable base for new content or features.",
        "results": [
          "Landing page with strong visual identity;",
          "Responsive and structured layout;",
          "Clear and intuitive experience;",
          "Project ready for evolution."
        ],
        "technologies": [
          "React",
          "TypeScript",
          "Motion",
          "Tailwind CSS",
          "Vite"
        ]
      },
      "advocacia": {
        "year": "2025",
        "subtitle": "Front-End Developer",
        "title": "Advocacia",
        "description": "The Tavares & Saraiva Advogados website was created as an online institutional presence for the law firm based in Pernambuco. The platform presents the legal services offered, the team of professionals and areas of practice, conveying credibility, ethics and commitment to results.",
        "client": "Tavares & Saraiva Advogados",
        "duration": "Institutional Website",
        "role": "Front-End Developer",
        "challenge": "The main challenge was to translate the authority and seriousness of a law firm into a clear and professional digital presence, without visual excess, and to present complex legal services in an accessible way. The site needed to be responsive, informative and functional for different audiences — potential clients, companies and users seeking legal support.",
        "solution": "The solution was to develop an elegant and functional institutional landing page focused on: a clear content structure highlighting legal practice areas, presentation of the professional team reinforcing credibility, intuitive and mobile-responsive navigation, and direct calls to action for contact and qualified lead generation.",
        "results": [
          "Professional institutional website;",
          "Responsive navigation on mobile devices;",
          "Clear content on areas of practice;",
          "Strategic calls to action for contact and conversion."
        ],
        "technologies": ["React", "TypeScript", "Next.js", "Tailwind CSS"]
      }
    }
  }
}
